 # 把字符串变成数值型int()

 # Python将非空的字符串解读为True


''' # 
str1 = '123456'
for _str in str1:
    print (str1)
'''

# 要循环字段时要在字段后面加.team

'''
def name(first_name, last_name):
    """ 返回完整的姓名"""
    full_name = first_name + " " + last_name
    return full_name.title()


message = name('jack', 'zhou')
print (message)
'''
# 调用返回值的函数时，需提供一个变量，用于存储返回的值。




 # 根据类来创建对象被称为实例化
# 类中的函数称为方法
# 以 self为前缀的变量都可供类中的所有方法使用
# 可通过实例访问的变量称为属性
# 根据类可以创建实例

# 创建了实例后(a),才可以调用类中的方法a.name
#(如果在本类中就可以不实例直接)，类的外面的话就要通过实例来调用类中的方法
# 类中的属性必需有初始值


# 一个类可以继承另外一个类，被继承的类称为父类，子类获得父类的所有属性和方法，子类还可以定义自己的属性和方法
 # 重写了父类的方法，子类方法名必须要与父类相同，调用该方法时就不会调用父类的方法了



